[
  {
    "version": "1.3.1-beta",
    "date": "2026-01-05",
    "changes": [
      "Fixed Change Log modal layout so it no longer sits behind the top navigation bar.",
      "Change Log now renders with a clear, visible close control across mobile and desktop.",
      "Improved modal safe-area handling to ensure premium, consistent spacing across devices."
    ]
  },
  {
    "version": "1.3.0-beta",
    "date": "2026-01-05",
    "changes": [
      "Introduced deterministic phrase identity using a stable contentKey system.",
      "Phrase identity is now based solely on normalised Lithuanian text (diacritics removed, punctuation and spacing ignored).",
      "contentKey is automatically generated when missing and preserved across import, export, and sync.",
      "This permanently fixes duplication across starter installs, imports, exports, cloud merges, and cross-device use.",
      "Starter pack behaviour is now fully idempotent: installing the starter pack multiple times never increases entry count.",
      "Starter entries now explicitly track Source: \"starter\" and Touched: false until edited.",
      "Editing a starter entry cleanly converts it to Source: \"user\" and sets Touched: true.",
      "Deleted starter entries are tombstoned and never reappear, even after reinstalling the starter pack.",
      "Implemented tombstone-based deletion system-wide using _deleted and _deleted_ts flags.",
      "Deleted entries remain in storage and exports, are hidden from the UI, and are respected by starter installs and cloud merges.",
      "Added a safe, conflict-aware cloud merge engine instead of blind overwrite behaviour.",
      "Merge logic matches entries by _id first and contentKey second, and never overwrites meaningful data with blanks.",
      "The merge engine detects edit vs delete conflicts and field-level conflicts (e.g. Notes edited on both devices).",
      "If conflicts are detected, the merge pauses and nothing is written to the cloud.",
      "If no conflicts are detected, a single safely merged library is written back to the cloud.",
      "Finalised an explicit, manual sync model with three clear actions: Upload, Download, and Merge.",
      "No background sync or silent overwrites occur by design to prioritise trust and data safety during beta.",
      "Duplicate Scanner reliability restored after identity and merge fixes, eliminating large false-positive groups.",
      "All add, edit, and delete flows are now fully store-controlled to ensure IDs, timestamps, and metadata are always correct.",
      "Cross-device behaviour verified in real-world testing with duplication-free, deletion-safe results."
    ]
  },
  {
    "version": "1.2.0-beta",
    "date": "2025-12-15",
    "changes": [
      "Added secure account sign-in with Google to enable multi-device use-test.",
      "Introduced cloud sync via Supabase, allowing your library to be uploaded and downloaded across devices.",
      "Implemented user-scoped cloud storage so each account’s data is fully isolated and protected.",
      "Added explicit Upload and Download buttons in Settings for safe, testable sync during beta.",
      "Session persistence now works across desktop, mobile browser, and installed PWA.",
      "Fixed logout issues on mobile and PWA caused by duplicate auth state handling.",
      "Resolved multiple service worker caching issues that prevented updates from reaching mobile and tablet devices.",
      "Restored Add Entry and Edit Entry forms to a proper modal overlay for a cleaner, more premium experience.",
      "Unified Add and Edit flows so both use the same modal system and behave consistently.",
      "Background enrichment now safely adds Usage, Notes, and Category without overwriting user edits.",
      "Improved overall stability of the app during navigation, auth changes, and device switching."
    ]
  },
  {
    "version": "1.1.1-beta",
    "date": "2025-12-10",
    "changes": [
      "Fixed Add/Edit modal positioning so it no longer appears clipped at the top.",
      "Modal safe-area padding corrected for Android and iOS devices.",
      "Modals now consistently centre correctly and avoid being pushed under the header.",
      "Add/Edit modal now fully resets state when changing tabs.",
      "Duplicate Scanner now auto-scrolls to the top when opened.",
      "General modal polish and improved consistency across the UI."
    ]
  },
  {
    "version": "1.1.0-beta",
    "date": "2025-12-09",
    "changes": [
      "Added smart pre-translation duplicate detection to stop accidental duplicate entries.",
      "Upgraded the Duplicate Scanner to handle punctuation and diacritic variations (e.g. \"ačiū\" vs \"aciu\").",
      "Added a Copy button so you can quickly copy Lithuanian translations from the Home screen.",
      "Improved translation behaviour and punctuation handling for simple greetings.",
      "Polished card shadows and layout to make the app feel more premium."
    ]
  },
  {
    "version": "1.0.0-beta",
    "date": "2025-12-02",
    "changes": [
      "Removed Lithuanian-to-English mode entirely. App now works cleanly as English → Lithuanian.",
      "Added manual Add Entry button on Home and Library for direct phrase creation.",
      "Improved AddForm: sheet dropdown added, cleaner layout, stable editing.",
      "Translation prompt simplified: \"What would you like to say?\"",
      "Translation API rebuilt. Cleaner EN→LT JSON pipeline with tone and listener gender handling.",
      "LibraryView fully redesigned around single-direction audio playback.",
      "Long-press slow audio + tap for normal audio standardised across the app.",
      "Header and Settings cleaned and simplified for new architecture.",
      "Removed all dead code related to direction, modes, and obsolete logic.",
      "UI consistency improvements and foundations laid for future source-language selector."
    ]
  }
]
