[
  {
    "version": "1.4.1-beta",
    "date": "2026-01-07",
    "changes": [
      "Published a full, detailed user guide at https://zodis.app/userguide and aligned in-app guidance to match.",
      "Improved early access messaging so non-invited users are guided to the correct next step without confusion.",
      "Polished modal layout and stacking behaviour to prevent the Change Log and Add Entry modals being clipped behind the header on some devices.",
      "General UI consistency improvements for a more premium, predictable modal experience across mobile, desktop, and PWA."
    ]
  },
  {
    "version": "1.4.0-beta",
    "date": "2026-01-06",
    "changes": [
      "Introduced closed beta access control to restrict app usage to invited testers only.",
      "Added a dedicated early-access sign-in screen shown before any app content loads.",
      "Expanded authentication options to include email-based sign-in (magic link) alongside Google sign-in, improving iOS compatibility.",
      "Implemented server-side beta enforcement using Supabase Row Level Security, ensuring access rules cannot be bypassed.",
      "Non-invited users now see a clear, friendly early-access message instead of entering the app.",
      "Added a direct link to the Žodis landing page for requesting beta access.",
      "Confirmed secure isolation of user libraries across accounts and devices under beta access rules.",
      "Fixed modal layering issues that caused dialogs to appear behind the app header.",
      "Restored correct positioning and rounded corners for Add Entry, Change Log, and other modals.",
      "Improved overall UI stacking consistency to prevent modal clipping regressions."
    ]
  },
  {
    "version": "1.3.0-beta",
    "date": "2026-01-05",
    "changes": [
      "Introduced deterministic phrase identity using a stable contentKey system.",
      "Phrase identity is now based solely on normalised Lithuanian text (diacritics removed, punctuation and spacing ignored).",
      "contentKey is automatically generated when missing and preserved across import, export, and sync.",
      "This permanently fixes duplication across starter installs, imports, exports, cloud merges, and cross-device use.",
      "Starter pack behaviour is now fully idempotent: installing the starter pack multiple times never increases entry count.",
      "Starter entries now explicitly track Source: \"starter\" and Touched: false until edited.",
      "Editing a starter entry cleanly converts it to Source: \"user\" and sets Touched: true.",
      "Deleted starter entries are tombstoned and never reappear, even after reinstalling the starter pack.",
      "Implemented tombstone-based deletion system-wide using _deleted and _deleted_ts flags.",
      "Deleted entries remain in storage and exports, are hidden from the UI, and are respected by starter installs and cloud merges.",
      "Added a safe, conflict-aware cloud merge engine instead of blind overwrite behaviour.",
      "Merge logic matches entries by _id first and contentKey second, and never overwrites meaningful data with blanks.",
      "The merge engine detects edit vs delete conflicts and field-level conflicts.",
      "If conflicts are detected, the merge pauses and nothing is written to the cloud.",
      "If no conflicts are detected, a single safely merged library is written back to the cloud.",
      "Finalised an explicit, manual sync model with Upload, Download, and Merge actions.",
      "Duplicate Scanner reliability restored after identity and merge fixes.",
      "Cross-device behaviour verified with duplication-free, deletion-safe results."
    ]
  },
  {
    "version": "1.2.0-beta",
    "date": "2025-12-15",
    "changes": [
      "Added secure account sign-in with Google to enable multi-device use during beta.",
      "Introduced cloud sync via Supabase for uploading and downloading libraries.",
      "Implemented user-scoped cloud storage so each account’s data is isolated and protected.",
      "Added explicit Upload and Download buttons in Settings for safe manual sync.",
      "Session persistence now works across desktop, mobile browser, and installed PWA.",
      "Fixed logout issues on mobile and PWA caused by duplicate auth state handling.",
      "Resolved service worker caching issues preventing updates on mobile devices.",
      "Restored Add Entry and Edit Entry forms to a proper modal overlay.",
      "Unified Add and Edit flows so both use the same modal system.",
      "Improved overall stability during navigation, auth changes, and device switching."
    ]
  }
]
